# Brewfile - Package manifest for Homebrew
# Install with: brew bundle

# Taps
tap "homebrew/bundle"

# Essential CLI tools
brew "zsh"
brew "tmux"
brew "git"
brew "neovim"  # or vim if you prefer

# Modern replacements for standard tools
brew "bat"        # Better cat
brew "eza"        # Better ls
brew "fd"         # Better find
brew "ripgrep"    # Better grep
brew "fzf"        # Fuzzy finder
brew "zoxide"     # Smart cd
brew "jq"         # JSON processor
brew "htop"       # Better top
brew "tldr"       # Simplified man pages

# Prompt and shell enhancement
brew "starship"   # Cross-shell prompt

# DevOps tools
brew "podman"     # Container management
brew "kubectl"    # Kubernetes CLI
brew "awscli"     # Comment out if you don't use AWS
brew "gh"         # GitHub CLI

# Development tools
brew "direnv"     # Environment switcher
brew "jenv"       # Java version manager (if needed)
brew "pyenv"      # Python version manager

# GUI Applications (optional)
cask "iterm2"           # Better terminal
cask "visual-studio-code"
cask "rectangle"        # Window management
